# Коментарі до коду починаються з символа решітки #
# Коментарі до коду ігноруються інтерпретатором Python і не впливають на
# швидкодію програми, проте допомогають іншим програмістам легше зрозуміти
# програмний код.

# За традицією, найперщою програмою на новій мові програмування є "Hello world".
# Для виведення будь-чого у консоль в мові програумування Python є вбудована
# функція print().

# * Для виклику функції необхідно поставити дужки () після неї
# * Функція print приймає довільну кількість аргументів. Аргументи функції
#   подаються всередині дужок і розділяються комою. Аргументи функції можуть
#   бути *позиціонними* (передаються за порядком: "Hello", "world") і 
#   *iменованими* (передаються за назвою: sep="value"). За PEP8 між
#   аргументами, що передаються, ставиться кома з пробілом після неї.

print("Hello, world!")
# print("Hello,", "world!")
# print("Hello", "world", sep="")

# print("Hello", end="---")
# print("world", end="\n")
# print("Hello, my dear friend")

# Можна використовувати як подвійні " так і одинарні лапки '. Головне,
# дотримуватись єдиного стилю в рамках однієї програми

# print('Hello, world!')
