# Як і в будь-якій іншій мові програмування загального призначення, в Python
# є безліч вбудованих операторів для виконання математичних операцій.

add = 7 + 3             # додавання
sub = 7 - 3             # віднімання
mul = 7 * 3             # множення
div = 7 / 3             # ділення

floor_div = 7 // 3      # цілочисельне ділення
mod = 7 % 3             # остача від ділення
power = 7 ** 3          # возведення в ступінь


# Результати виконання операцій виводимо в консоль. Зверни увагу, що
# форматування виводу цього разу відбувається не за рахунок передачі декількох
# аргументів фукнції print(), а за рахунок форматування строки f""

# Також, при форматуванні строк використовується спеціальний символ \t, що
# позначає табуляцію (відступ)
# print("Addition:\t7 + 3 =", add)

print(f"Addition:\t7 + 3 = {add}")
print(f"Subtraction:\t7 - 3 = {sub}")
print(f"Multiplication:\t7 * 3 = {mul}")
print(f"Division:\t7 / 3 = {div}")
print(f"Modulus:\t7 % 3 = {mod}")
print(f"Floor division:\t7 // 3 = {floor_div}")
print(f"Exponentiation:\t7 ** 3 = {power}")
