sequence = ("First", "Second", "Third")

# Більш продвинутим варіантом циклу є цикл for ... in ...
# Після ключового слова for вказується назва нової змінної, що буде приймати
# значення певної послідовности.
# Після ключового слова in вказується певна послідовность, що по ній буде
# ітеруватись цикл.
for item in sequence:
    print("Sequence item:", item)

# Функція range() повертає в результаті свого виконання послідовність чисел
# від нуля до вказаного аргументмо числа. Наприклад, range(3) поверне
# послідовність чисел 0, 1, 2.
# for i in range(len(sequence)):
#     print(f"Sequence item at index {i}: {sequence[i]}")
