# Крім кортежів для позначення переліків в Python також використовується тип
# даних (list). Різницею між кортежами і списками є той факт, що списки - це
# змінюваний тип даних. В ході виконання Python-скрипту, вони можуть як
# змінювати свою довжину, так і змінювати значення певних елементів за індексом

# Ініціалізація списку відбувається переліченням елементів в квадратних
# дужках []. Так само, як і в кортежах, елементи списку відділяються один від
# одного комою
my_list = [1, 2, 3, 4, 5]
print("my_list items are", my_list)
print("my_list type is", type(my_list))

# Отримання елементів списку за індексом відбувається так само, як і отримання
# елементів кортежу - з використанням квадратних дужок
print("Second element of my_list is", my_list[1])

# Як вже було зазначено раніше, списки дозволяють також модифікувати значення
# за індексом
my_list[1] = 153
print("my_list items after updating second element value:", my_list)

# Списки, так само як і кортежі, можуть складатися з переліку даних різних
# типів:
different_data_types_list = [1, "Second", 3.0, False]
print("List of different data types;", different_data_types_list)

# Списки, так само як і кортежі, можуть бути вкладені:
my_2d_list = [
    [1, 2, 3],
    [2, 3, 4],
    [3, 4, 5],
]
print("my_2d_list items are", my_2d_list)
